jvi326/AGV-5th-Semester/STM32/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include <stdbool.h>
#include "stm32f051x8.h"
#include "motor_controller.h"
#include "chassis.h"
#include "Bluetooth_USART2.h"
#include "IR.h"
#include "Global_Stop_Causes.h"

#define RX_BUF_SIZE 32
#define MAX_MENSAJE 20

IRSensor IR_MostOuterRight = { GPIOB, 9};
IRSensor IR_OuterRight = { GPIOB, 10};
IRSensor IR_CenterRight = { GPIOB, 11};
IRSensor IR_Center = { GPIOB, 12};
IRSensor IR_CenterLeft = { GPIOB, 13};
IRSensor IR_OuterLeft = { GPIOB, 14};
IRSensor IR_MostOuterLeft = { GPIOB, 15};

volatile bool emergencyStop = 0;
volatile int emergencyCounter = 0;
volatile int error_0_counter = 0;

volatile bool sensorStates[7];

bool justEnteredLineMode;
bool dis_detected;
int lineFollowerMode = 0;

float forward_speed_LF = 0; // Choose based on desired speed (0.0 to 1.0)
float temp_P = 0.15;
float temp_I = 0;
float temp_D = 0.45;

int main(void) {
	USART2_Init_Interrupt();
	System_Ready_Indicator();
	StopCauses_Init();

	MotorController motorA;
	MotorController motorB;
	CHASSIS agv;

	// Initialize motor (Dir1, Dir2, PWM, BrakePin)
	Motor_Init(&motorA, 6, 7, 8, 5);
	Motor_Init(&motorB, 10, 11, 9, 4);
	Motor_Invert(&motorB, 1);
	Init_Chassis(&agv,motorA,motorB);
	set_AdvanceInverted(&agv, 1);

	LineFollower Follower = {IR_MostOuterRight, IR_OuterRight, IR_CenterRight, IR_Center, IR_CenterLeft, IR_OuterLeft, IR_MostOuterLeft};
	LineFollower_Init(&Follower);

   // Test sequence
    while (1) {

    	if (rx_ready == 1) {
			USART2_HandleMessage(&agv);
		}

		if ((!emergencyStop) & stop_flags.bluetooth_flag & (!stop_flags.distance1_flag) & (!stop_flags.distance2_flag)) {

			if ((lineFollowerMode == 0)) {
				apply_CurrentSpeedsToMotors_noBrake_if_0(&agv);
			} else if ((lineFollowerMode == 1)) {
				if (justEnteredLineMode) {
				    resetPID();  // integral = 0, last_error = 0
				    justEnteredLineMode = 0;
				}
				apply_CurrentSpeedsToMotors_noBrake_if_0(&agv);
				LineFollower_FollowLine(&Follower, &agv, forward_speed_LF);
			} else if (lineFollowerMode == 2) {
				if (justEnteredLineMode) {
				    resetPID();  // integral = 0, last_error = 0
				    justEnteredLineMode = 0;
				}
				LineFollower_FollowLine_PID(&Follower, &agv, forward_speed_LF, temp_P, temp_I, temp_D);
			}
		} else {
			pause_Chassis(&agv);
		}
	}
}

